In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    "Brand":['Maruti',"Hyundai","Tata","Mahindra","Maruti","Hyundai","Renault","Tata","Maruti"],
    "Year":[2012,2013,2013,2014,2015,2018,2017,2016,2014],
    "Kms driven":[5000,2000,3000,4000,6000,2000,3400,7000,9000],
    "City":["Gurgaon","Delhi","Mumbai","Kolkata","Ahemdabad","Pune","Mumbai","Bangalore","Delhi"],
    "Mileage":[28,27,25,26,28,29,24,21,24]
})

data

      Brand  Year  Kms driven       City  Mileage
0    Maruti  2012        5000    Gurgaon       28
1   Hyundai  2013        2000      Delhi       27
2      Tata  2013        3000     Mumbai       25
3  Mahindra  2014        4000    Kolkata       26
4    Maruti  2015        6000  Ahemdabad       28
5   Hyundai  2018        2000       Pune       29
6   Renault  2017        3400     Mumbai       24
7      Tata  2016        7000  Bangalore       21
8    Maruti  2014        9000      Delhi       24

In [3]:
data.loc[(data.Brand == 'Maruti') & (data.Mileage > 25)]

    Brand  Year  Kms driven       City  Mileage
0  Maruti  2012        5000    Gurgaon       28
4  Maruti  2015        6000  Ahemdabad       28

In [4]:
data.loc[2:5, ['Brand','Mileage']]

      Brand  Mileage
2      Tata       25
3  Mahindra       26
4    Maruti       28
5   Hyundai       29

In [5]:
x = data['Year'] < 2015
data.loc[x, "Mileage"] = 22
data

      Brand  Year  Kms driven       City  Mileage
0    Maruti  2012        5000    Gurgaon       22
1   Hyundai  2013        2000      Delhi       22
2      Tata  2013        3000     Mumbai       22
3  Mahindra  2014        4000    Kolkata       22
4    Maruti  2015        6000  Ahemdabad       28
5   Hyundai  2018        2000       Pune       29
6   Renault  2017        3400     Mumbai       24
7      Tata  2016        7000  Bangalore       21
8    Maruti  2014        9000      Delhi       22

In [6]:
data.iloc[[0,2,4,7]]

    Brand  Year  Kms driven       City  Mileage
0  Maruti  2012        5000    Gurgaon       22
2    Tata  2013        3000     Mumbai       22
4  Maruti  2015        6000  Ahemdabad       28
7    Tata  2016        7000  Bangalore       21

In [7]:
data.iloc[1:4, 2:4]

   Kms driven     City
1        2000    Delhi
2        3000   Mumbai
3        4000  Kolkata

---

In [8]:
data = {
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'Salary':[50000,60000,70000,80000]
}

In [9]:
df = pd.DataFrame(data, index=['A','B','C','D'])
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40   80000

In [10]:
df.loc['B']

Name        Bob
Age          30
Salary    60000
Name: B, dtype: object

In [11]:
df.loc[df['Name'] == "Charlie", 'Salary']

C    70000
Name: Salary, dtype: int64

In [12]:
df.iloc[:2,:2]

    Name  Age
A  Alice   25
B    Bob   30

In [13]:
df.iloc[-1,-1]

80000

In [14]:
df.loc[df['Age']>30]

      Name  Age  Salary
C  Charlie   35   70000
D    David   40   80000

In [15]:
df.loc[df['Salary']>60000,['Name','Salary']]

      Name  Salary
C  Charlie   70000
D    David   80000

In [16]:
df.loc[df['Name'] == "David", 'Salary'] = 90000

In [17]:
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40   90000

In [18]:
df.iloc[0:,1] = 28

In [19]:
df

      Name  Age  Salary
A    Alice   28   50000
B      Bob   28   60000
C  Charlie   28   70000
D    David   28   90000

In [20]:
df.loc['B':'D']

      Name  Age  Salary
B      Bob   28   60000
C  Charlie   28   70000
D    David   28   90000

In [21]:
df.loc[:, ['Salary', 'Age']]

   Salary  Age
A   50000   28
B   60000   28
C   70000   28
D   90000   28

In [22]:
df.iloc[0:,0:3]

      Name  Age  Salary
A    Alice   28   50000
B      Bob   28   60000
C  Charlie   28   70000
D    David   28   90000